## Working with Missing Data

In [8]:
import pandas as pd
my_dict = {'A':[1, 2, 3], 'B': [4, None, 6], 'C': [7, None, None]}
df = pd.DataFrame(my_dict)

In [3]:
df

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  NaN

In [6]:
df.dropna(inplace=True)

In [9]:
df

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  NaN

In [10]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)

   A    B    C
0  1  4.0  7.0
2  3  6.0  NaN

In [13]:
df

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  NaN

In [14]:
df.fillna(value='PYTHON')

   A       B       C
0  1       4       7
1  2  PYTHON  PYTHON
2  3       6  PYTHON

In [15]:
df

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  NaN

In [16]:
df.fillna(value=100)

   A      B      C
0  1    4.0    7.0
1  2  100.0  100.0
2  3    6.0  100.0

In [17]:
df

   A    B    C
0  1  4.0  7.0
1  2  NaN  NaN
2  3  6.0  NaN

In [18]:
df['B'].fillna(value=df['B'].mean())

0    4.0
1    5.0
2    6.0
Name: B, dtype: float64